# Dz na 07.12.23
a = int(input("Первый талон: "))
b = int(input("Второй талон: "))
c = int(input("Третий талон: "))
d = int(input("Четвёртый талон: "))
a = a // 1000 + a % 1000 // 100 + a % 1000 % 100 // 10 + a % 1000 % 100 % 10
b = b // 1000 + b % 1000 // 100 + b % 1000 % 100 // 10 + b % 1000 % 100 % 10
c = c // 1000 + c % 1000 // 100 + c % 1000 % 100 // 10 + c % 1000 % 100 % 10
d = d // 1000 + d % 1000 // 100 + d % 1000 % 100 // 10 + d % 1000 % 100 % 10
count = 0
if a % 2 == 0:
    count += 1
if b % 2 == 0:
    count += 1
if c % 2 == 0:
    count += 1
if d % 2 == 0:
    count += 1
print(count)